# Importación de librerías y visualización de datos

In [1]:
import pandas as pd

from sys import path
path.append('../src')
import auxiliar

## Visualización de actor

In [2]:
actor = pd.read_csv('../data/actor.csv')

actor

,Unnamed: 0,Unnamed: 0.1,actor_id,first_name,last_update
0,0,0,1,PENELOPE GUINESS GUINESS,2006-02-15 04:34:33
1,1,1,2,NICK WAHLBERG WAHLBERG,2006-02-15 04:34:33
2,2,2,3,ED CHASE CHASE,2006-02-15 04:34:33
3,3,3,4,JENNIFER DAVIS DAVIS,2006-02-15 04:34:33
4,4,4,5,JOHNNY LOLLOBRIGIDA LOLLOBRIGIDA,2006-02-15 04:34:33
...,...,...,...,...,...
195,195,195,196,BELA WALKEN WALKEN,2006-02-15 04:34:33
196,196,196,197,REESE WEST WEST,2006-02-15 04:34:33
197,197,197,198,MARY KEITEL KEITEL,2006-02-15 04:34:33
198,198,198,199,JULIA FAWCETT FAWCETT,2006-02-15 04:34:33
199,199,199,200,THORA TEMPLE TEMPLE,2006-02-15 04:34:33

In [3]:
actor.shape

(200, 5)

In [4]:
actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    200 non-null    int64
 1   Unnamed: 0.1  200 non-null    int64
 2   actor_id      200 non-null    int64
 3   first_name    200 non-null    object
 4   last_update   200 non-null    object
dtypes: int64(3), object(2)
memory usage: 7.9+ KB

In [5]:
#actor['first_name'] += ' ' + actor['last_name']

#actor.drop(['last_name'], axis=1, inplace=True)

#actor.head()

Ninguna columna tiene valores nulos, luego no es necesario hacer limpieza de este archivo.

## Visualización de category

In [6]:
category = pd.read_csv('../data/category.csv')

category

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [7]:
category.shape

(16, 3)

In [8]:
category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

No contiene valores nulos en las columnas, luego no es necesario hacer limpieza.

## Visualización de old_HDD

In [9]:
old = pd.read_csv('../data/old_HDD.csv')
old

,Unnamed: 0,first_name,title,release_year,category_id
0,0,PENELOPE GUINESS,ACADEMY DINOSAUR,2006.0,6.0
1,1,PENELOPE GUINESS,ANACONDA CONFESSIONS,2006.0,2.0
2,2,PENELOPE GUINESS,ANGELS LIFE,2006.0,13.0
3,3,PENELOPE GUINESS,BULWORTH COMMANDMENTS,2006.0,10.0
4,4,PENELOPE GUINESS,CHEAPER CLYDE,2006.0,14.0
...,...,...,...,...,...
1381,1381,Unknown,CHICAGO NORTH,2006.0,0.0
1382,1382,Unknown,MADNESS ATTACKS,2006.0,0.0
1383,1383,Unknown,ALI FOREVER,2006.0,0.0
1384,1384,Unknown,GRAFFITI LOVE,2006.0,0.0
1385,1385,Unknown,PIRATES ROXANNE,2006.0,0.0

In [10]:
#old['first_name'] += ' ' + old['last_name']
#old

In [11]:
#old.drop(['last_name'], axis=1, inplace = True)
#old.head()

## Visualización de film

In [12]:
film = pd.read_csv('../data/film.csv')

film.head()

,Unnamed: 0,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [13]:
film.shape

(1000, 13)

In [14]:
film.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        1000 non-null   int64
 1   film_id           1000 non-null   int64
 2   title             1000 non-null   object
 3   description       1000 non-null   object
 4   release_year      1000 non-null   int64
 5   language_id       1000 non-null   int64
 6   rental_duration   1000 non-null   int64
 7   rental_rate       1000 non-null   float64
 8   length            1000 non-null   int64
 9   replacement_cost  1000 non-null   float64
 10  rating            1000 non-null   object
 11  special_features  1000 non-null   object
 12  last_update       1000 non-null   object
dtypes: float64(2), int64(6), object(5)
memory usage: 101.7+ KB

Todas las columnas menos "original_language_id" no poseen valores nulos, y esta contiene todos los valores nulos; por lo tanto debemos estudiar qué ocurre aquí.

## Visualización de inventory

In [15]:
inventory = pd.read_csv('../data/inventory.csv')

inventory

     inventory_id  film_id  store_id          last_update
0               1        1         1  2006-02-15 05:09:17
1               2        1         1  2006-02-15 05:09:17
2               3        1         1  2006-02-15 05:09:17
3               4        1         1  2006-02-15 05:09:17
4               5        1         2  2006-02-15 05:09:17
..            ...      ...       ...                  ...
995           996      222         2  2006-02-15 05:09:17
996           997      222         2  2006-02-15 05:09:17
997           998      222         2  2006-02-15 05:09:17
998           999      223         2  2006-02-15 05:09:17
999          1000      223         2  2006-02-15 05:09:17

[1000 rows x 4 columns]

In [16]:
inventory.shape

(1000, 4)

In [17]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

Ninguna columna posee valores nulos, luego no es necesario hacer limpieza de datos.

## Visualización de language

In [18]:
language = pd.read_csv('../data/language.csv')

language

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [19]:
language.shape

(6, 3)

In [20]:
language.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

No posee valores nulos en ninguna de sus columnas y no es necesario hacer limpieza de datos.

## Visualización de rental

In [21]:
rental = pd.read_csv('../data/rental.csv')

rental.head()

,Unnamed: 0,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,1,2,2005-05-24 22:54:33,525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,2,3,2005-05-24 23:03:39,711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,3,4,2005-05-24 23:04:41,452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,4,5,2005-05-24 23:05:21,79,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [22]:
rental.shape

(1000, 8)

In [23]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    1000 non-null   int64
 1   rental_id     1000 non-null   int64
 2   rental_date   1000 non-null   object
 3   inventory_id  1000 non-null   int64
 4   customer_id   1000 non-null   int64
 5   return_date   1000 non-null   object
 6   staff_id      1000 non-null   int64
 7   last_update   1000 non-null   object
dtypes: int64(5), object(3)
memory usage: 62.6+ KB

No posee valores nulos, luego no es necesario hacer limpieza de datos.

# Limpieza de datos

Como el único dataframe que contiene columnas nulas es film, tenemos que averiguar cuál es la mejor forma de transformar esos valores nulos en no nulos. Es decir, si darles un valor estándar a toda la columna, eliminar la columna, o bien, encontrar algún tipo de relación entre esa columna y el resto de dataframe para la construcción de la base de datos posterior.

Como no es posible encontrar relación alguna con el resto de columnas de los otros archivos csv, entonces eliminamos esa columna.

In [24]:
#film.drop(['Unnamed: 0'], axis=1, inplace=True)

film['release_year'].unique()

array([2006])

In [25]:
film.to_csv('../data/film.csv')

Vamos a añadir la categoría 0 para poder completar las columnas en old_HDD y que el modelo sea consistente.

In [26]:
category = category.append({'category_id' : 0}, ignore_index=True)

In [27]:
category = category.fillna('Unknown')
category

    category_id         name          last_update
0           1.0       Action  2006-02-15 04:46:27
1           2.0    Animation  2006-02-15 04:46:27
2           3.0     Children  2006-02-15 04:46:27
3           4.0     Classics  2006-02-15 04:46:27
4           5.0       Comedy  2006-02-15 04:46:27
5           6.0  Documentary  2006-02-15 04:46:27
6           7.0        Drama  2006-02-15 04:46:27
7           8.0       Family  2006-02-15 04:46:27
8           9.0      Foreign  2006-02-15 04:46:27
9          10.0        Games  2006-02-15 04:46:27
10         11.0       Horror  2006-02-15 04:46:27
11         12.0        Music  2006-02-15 04:46:27
12         13.0          New  2006-02-15 04:46:27
13         14.0       Sci-Fi  2006-02-15 04:46:27
14         15.0       Sports  2006-02-15 04:46:27
15         16.0       Travel  2006-02-15 04:46:27
16          0.0      Unknown              Unknown

Vamos a añadir a la tabla de old_HDD todos los titulos de films que no se encuentran en estas, pues va a ser la tabla intermediaria entre film y actors. Además, aunque compartan released_year, no podríamos engancharla por ahí poque puede haber varias pelis que se estrenaron el mismo año.

In [28]:
old.head()

,Unnamed: 0,first_name,title,release_year,category_id
0,0,PENELOPE GUINESS,ACADEMY DINOSAUR,2006.0,6.0
1,1,PENELOPE GUINESS,ANACONDA CONFESSIONS,2006.0,2.0
2,2,PENELOPE GUINESS,ANGELS LIFE,2006.0,13.0
3,3,PENELOPE GUINESS,BULWORTH COMMANDMENTS,2006.0,10.0
4,4,PENELOPE GUINESS,CHEAPER CLYDE,2006.0,14.0

In [29]:
conj = set(list(film['title']))

In [30]:
unicos = list(old['title'].unique())
        
old = old.append([{'title' : i} for i in conj if i not in unicos], ignore_index = True)

old.drop(['Unnamed: 0'], axis=1, inplace=True)

In [31]:
old['first_name'] = old['first_name'].fillna('Unknown')

old['category_id'] = old['category_id'].fillna(0)

old['release_year'] = old['release_year'].fillna(2006)

In [32]:
old

            first_name                  title  release_year  category_id
0     PENELOPE GUINESS       ACADEMY DINOSAUR        2006.0          6.0
1     PENELOPE GUINESS   ANACONDA CONFESSIONS        2006.0          2.0
2     PENELOPE GUINESS            ANGELS LIFE        2006.0         13.0
3     PENELOPE GUINESS  BULWORTH COMMANDMENTS        2006.0         10.0
4     PENELOPE GUINESS          CHEAPER CLYDE        2006.0         14.0
...                ...                    ...           ...          ...
1381           Unknown          CHICAGO NORTH        2006.0          0.0
1382           Unknown        MADNESS ATTACKS        2006.0          0.0
1383           Unknown            ALI FOREVER        2006.0          0.0
1384           Unknown          GRAFFITI LOVE        2006.0          0.0
1385           Unknown        PIRATES ROXANNE        2006.0          0.0

[1386 rows x 4 columns]

In [33]:
old.to_csv('../data/old_HDD.csv')

In [34]:
actor.head()

,Unnamed: 0,Unnamed: 0.1,actor_id,first_name,last_update
0,0,0,1,PENELOPE GUINESS GUINESS,2006-02-15 04:34:33
1,1,1,2,NICK WAHLBERG WAHLBERG,2006-02-15 04:34:33
2,2,2,3,ED CHASE CHASE,2006-02-15 04:34:33
3,3,3,4,JENNIFER DAVIS DAVIS,2006-02-15 04:34:33
4,4,4,5,JOHNNY LOLLOBRIGIDA LOLLOBRIGIDA,2006-02-15 04:34:33

In [35]:
actor.to_csv('../data/actor.csv')

In [36]:
rental['inventory_id'] = rental['inventory_id'].apply(lambda x : x%1000)
rental

,Unnamed: 0,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,1,2,2005-05-24 22:54:33,525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,2,3,2005-05-24 23:03:39,711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,3,4,2005-05-24 23:04:41,452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,4,5,2005-05-24 23:05:21,79,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...,...
995,995,997,2005-05-31 00:08:25,243,216,2005-06-02 00:17:25,2,2006-02-15 21:30:53
996,996,998,2005-05-31 00:16:57,395,389,2005-06-01 22:41:57,1,2006-02-15 21:30:53
997,997,999,2005-05-31 00:25:10,433,413,2005-06-03 06:05:10,2,2006-02-15 21:30:53
998,998,1000,2005-05-31 00:25:56,774,332,2005-06-08 19:42:56,2,2006-02-15 21:30:53
999,999,1001,2005-05-31 00:46:31,498,64,2005-06-06 06:14:31,2,2006-02-15 21:30:53

In [37]:
rental.to_csv('../data/rental.csv')